Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/L01.tmx
Source language: en_us
Languages: zh_cn

source: The Crabapple Tree
zh_cn: 花红树

source: This happened here in our town.
zh_cn: 这件事发生在我们的镇上。

source: A friend of mine- we were on the cheerleading team together- married a local farmer, and right away they wanted to have a baby, though the doctor said she shouldn't.
zh_cn: 我的一位朋友——曾经的啦啦队队友——嫁给了当地的一位农民。他们才结婚就想要孩子，可是医生说不行。

source: She was a bleeder, he said, and if she started he might not be able to stop it. But she didn't listen.
zh_cn: 医生说，她容易出血，而且出血的话恐怕会止不住，可是她不听劝。

source: She went ahead and got pregnant, then bled to death during childbirth and was buried out by the farmhouse, under a crabapple tree.
zh_cn: 她怀上了孩子，在分娩的时候出血死亡，被葬在农舍边上的花红树下。

source: It was very sad. I cried for a week.
zh_cn: 这让人很难过，我哭了一个星期。

source: But the baby survived, a pretty little boy; his dad called him Dickie- boy, but I don't know if that was his real name.
zh_cn: 不过，她的孩子活了下来。他是个漂亮的小男生，父亲叫他驴蛋，不过我不知道那是不是他的真名。

source: His dad was a hard worker and a nice guy- I went on a movie date with him once when we were young- but he sometimes drank too much and he was hopeless at ordinary household chores and raising babies. So pretty soon he found another wife, either through a dating service or else he picked her up in one of his bars somewhere, because none of us girls knew her.
zh_cn: 他的父亲很勤劳，人也还不错——年轻的时候我和他约会看过电影——只是他有些时候会酗酒，而且对家务事和养孩子一窍不通，所以他很快就又找了个妻子。这个妻子要么是他通过婚介服务找来的，要么是他在某家酒吧带回来的，因为我们这些姑娘都不认识她。

source: She was a tough, sexy lady, a hooker, maybe.
zh_cn: 她是个蛮横、性感的女人，或许还是个妓女。

source: She made no effort to be one of us or to make us like her.
zh_cn: 她没有试着融入我们，也没有试着让我们喜欢她。

source: I guess she considered us beneath her.
zh_cn: 我猜她是觉得我们都不如她。

source: We called her the Vamp.
zh_cn: 我们叫他妖妇。

source: She got around, and it was said that she'd taken half the men in town to bed, my own ex included.
zh_cn: 她到处闲逛，据说镇上半数的男人都被她勾引上过床，其中还有我的前任。

source: They all denied it, like cheating husbands do, but, when the subject came up, little shit-eating grins would appear on their faces and their eyes would glaze over as if they were remembering the wild time they'd had.
zh_cn: 他们都不承认，出轨的丈夫都会这样，但只要谈到这个话题，他们的脸上就会挂起尴尬的嬉笑，目光就会变得呆滞，似乎是在回忆曾经的巫山云雨。

source: Maybe Dickie-boy's dad knew about all that, and maybe he didn't.
zh_cn: 驴蛋的父亲或许知道这些事情，或许也并不知道。

source: He was mostly either drunk or out in the fields, and he left the raising of the kid to his new wife.
zh_cn: 大多数情况下，他要么是酩酊大醉，要么是在地里，把养孩子的事情交给新任妻子。

source: He loved Dickie-boy to the extent that the child reminded him of his dead wife, but resented him for the same reason, just as he resented the boy's mother for selfishly dying on him.
zh_cn: 他很爱驴蛋，以至于驴蛋会让他想起亡妻。出于同样的原因，他也憎恨驴蛋，就如同怨恨孩子的母亲自私地抛下他死去。

source: He had hoped for a sturdy fellow to help around the farm, but Dickie-boy was a sickly, fine-boned child who had trouble lifting a finger to pick his nose, forget pitchforks and shovels.
zh_cn: 他本来希望农场里能有个强健的家伙帮忙，可是驴蛋体弱多病、骨瘦如柴，连动手抠鼻子都困难，更不用说使干草叉和铲子了。

source: Certainly he didn't get on with the Vamp, who had a mean temper and slapped him around, with or without an excuse.
zh_cn: 驴蛋和妖妇的关系自然不好，妖妇脾气暴躁，常常不分青红皂白地扇他耳光。

source: The Vamp had a daughter from a previous relationship, a cute kid with big dreamy eyes, called Marleen.
zh_cn: 妖妇有个女儿，是从之前的感情里带来的。她叫玛莲，长着一双漂亮的大眼睛。

source: I never knew what to make of her.
zh_cn: 我根本搞不懂她。

source: Marleen seemed to live in a storybook land of her own.
zh_cn: 她似乎是生活在自己的童话王国里。

source: When she spoke, she spoke to the world, the way singers do, and what she said seldom made any sense.
zh_cn: 在她说话的时候，她就像歌手那样，对着世界说话，而且她的话基本上没有意义。

source: You probably had to be a kid to understand her at all.
zh_cn: 想要理解她，你或许得是个孩子。

source: My little girl- she's a young woman now and has her own little girl- was the same age as Marleen, and sometimes the two of them played together, my daughter pedalling her bike out to the farm and back, or sometimes I took her and picked her up.
zh_cn: 我的女儿——现在是个年轻女性，也有了自己的女儿——和玛莲同岁。她俩有时会在一起玩耍——我女儿骑着单车往返她家农场，或者有时由我负责接送。

source: My daughter had a lot of stories about Marleen, but I didn't always understand those, either.
zh_cn: 我女儿讲过许多关于玛莲的故事，可是我无法全都理解。

source: Marleen settled right in with her new little stepbrother. They were as tight as crib siblings and had a way of talking to each other that didn't use words.
zh_cn: 玛莲和她的继弟合得来，他们像亲兄妹那样亲密，有着一种不用言语也能相互交流的方法。

source: My daughter said it might be bird talk, which Marleen had offered to teach her.
zh_cn: 我女儿说那可能是鸟语，而且玛莲说过要教她。

source: Some people said that Dickie-boy wasn't all there, others that he had something almost magical about him.
zh_cn: 有人说驴蛋神志不正常，也有人说他拥有近乎魔法的东西。

source: Once, for example, he somehow crawled up onto the barn roof, and they had to call the Fire Department to get him down.
zh_cn: 比如说，他有次不知怎的爬到了谷仓顶上，人们叫来消防队才把他救下来。

source: The fire marshal said he had no idea how the boy could have got up there, unless he flew.
zh_cn: 消防队长说，除非驴蛋能飞，不然他还真不知道他是怎么上去的。

source: Marleen said he did it because the birds wanted him to.
zh_cn: 玛莲说，驴蛋爬到房顶去，是因为鸟儿让他那样做。

source: She told my daughter that the crabapple tree had helped him, though it was over near the house, not the barn.
zh_cn: 她告诉我女儿，那棵花红树帮了驴蛋，尽管它是在住房而非谷仓边上。

source: I had no idea what she meant. My daughter didn't know, either, and Marleen never announced it in her peculiar way of speaking.
zh_cn: 我不知道她的意思是什么，我女儿也不知道，而且玛莲从来没有用她那奇特的说话方式说过。

source: My daughter and Marleen played dolls and house and nursie, just like all little girls do, and sometimes they used Dickie-boy in their games. In nice ways and maybe not-so-nice ways.
zh_cn: 和其他小女生一样，我女儿和玛莲会玩过家家，有些时候她们会在游戏里利用驴蛋，方式有时友好，有时或许并不那么友好。

source: Strange Marleen might get up to anything, and my own daughter had a mischievous and curious streak, so things probably happened.
zh_cn: 奇怪的玛莲可能会做出任何事，而我的女儿也有着顽皮和好奇的性格，所以或许确实发生过一些事情。

source: Kids are kids, after all. I figured it was best to mostly look the other way.
zh_cn: 孩子毕竟是孩子，我觉得多数情况下最好是换个角度看事情。

source: Children have to be allowed to grow up on their own- I've always believed that.
zh_cn: 我始终相信，孩子应该能够自由地成长。

source: Marleen wanted a doggy, for example, so she put a collar and a leash on Dickie-boy and walked him around on his hands and knees with his clothes off and did circus tricks with him.
zh_cn: 例如，玛莲想要小狗，所以就给驴蛋套上项圈，拴上绳子，让他脱掉衣服，爬在地上四处遛他，而且还用他玩些马戏一样的把戏。

source: She even taught him to wee with his leg in the air.
zh_cn: 她甚至教他在尿尿时抬起一只脚。

source: He never complained.
zh_cn: 他从未抱怨过。

source: When he did bad things, like biting the mailman or pooping on his stepmother's bed, Marleen swatted his behind with a rolled-up newspaper just as you would a puppy. Then he'd whimper until she scratched between his ears and gave him a cookie.
zh_cn: 如果他做了坏事，比如说咬了邮递员，或者在继母床上大便，玛莲就会像你打小狗那样，卷起报纸拍打他的屁股，而他会则会抽泣，直到玛莲挠挠他的后脑勺，给他一块饼干。

source: My daughter said that Dickie-boy seemed to do bad things on purpose so as to get swatted.
zh_cn: 我女儿说，驴蛋好像是为了被打，才故意做坏事的。

source: I suppose he was just looking for attention, given the kind of parents he had.
zh_cn: 我想，鉴于他拥有那样的父母，他那样做只是为得到关注。

source: His dad was never around, and the Vamp hated him, so all he had was Marleen and her games.
zh_cn: 他父亲从不在身边，而且妖妇很讨厌他，所以他所拥有的只有玛莲和她的游戏。

source: Dickie-boy wasn't very healthy, but whenever he got sick Marleen made him well again.
zh_cn: 驴蛋不是很健康，但只要他生病，玛莲都会让他康复。

source: It was a gift she had.
zh_cn: 这是她的天赋。

source: It sometimes worked on others, too.
zh_cn: 有些时候，这种天赋甚至在别人身上也有用。

source: One time, my daughter had a bad case of tonsillitis, and I thought her tonsils would have to come out, but Marleen somehow brought her fever down and she hasn't had tonsillitis since.
zh_cn: 有一次，我女儿患了严重的扁桃体炎，我以为她得去把扁桃体切除，可玛莲不知怎的给她降了烧，而她再也没有患过扁桃体炎了。

source: Marleen couldn't do anything for my ingrown toenail and canker sores, though.
zh_cn: 不过，对于我脚趾甲长到肉里和我的口腔溃疡，玛莲却无能为力。

source: Dickie-boy had gifts, too, and one of them was finding lost things.
zh_cn: 驴蛋也有许多天赋，其中之一便是寻找失物。

source: Once, I lost an earring, and my daughter brought Marleen and Dickie-boy over to the house to find it.
zh_cn: 有一次，我掉了一只耳环，我的女儿把玛莲和驴蛋带到家里面来找。

source: He got down on all fours with his face near the floor, and Marleen showed him the matching earring and made a chirping noise that probably meant "Fetch!," because that's exactly what he did.
zh_cn: 驴蛋趴在地上，脸贴近地板。玛莲给他看了另外一只耳环，然后发出唧唧的声音，意思或许是“去找回来！”，因为他确实去把那只耳环找了回来。

source: It had fallen into one of my old sneakers in the closet.
zh_cn: 耳环是掉在衣柜里一只旧运动鞋里面的。

source: He also found a nail brush I didn't even know was lost.
zh_cn: 他还找回来一把我都不知道已经丢失了的指甲刷。

source: Hide-and-seek wasn't any fun at all, my daughter said, because Dickie-boy always went straight to where they were.
zh_cn: 躲猫猫没有意思，我女儿说，因为驴蛋总是能直接找到她们的藏身处。

source: Same with blindman's bluff- it was as if he could see right through the blindfold.
zh_cn: 蒙眼捉迷藏也一样——他似乎能看穿蒙眼的布条。

source: And ghost-in-the-graveyard, if you played it at night, could be downright scary, because he could give you the feeling that he was there and not there at the same time.
zh_cn: 在晚上玩“鬼来了”[1]的游戏特别恐怖，因为他会让你觉得他在那里，同时也会让你觉得他没在那里。

source: Marleen could be scary, too.
zh_cn: 玛莲也会让人毛骨悚然。

source: Whenever she was around, staring her wide-eyed stare and talking aloud to nobody in particular, I kept stumbling and dropping things.
zh_cn: 在她睁大眼睛凝视，并对着空气说话时，我总会跌跌撞撞，拿不住东西。

source: My daughter said the same thing happened to their schoolteacher, who sometimes sent Marleen out of the room so she could clear her head.
zh_cn: 我女儿说，学校老师也有同样的经历，而且老师有时会把她撵出教室，让她清醒一下脑子。

source: Marleen often played with Dickie-boy the way you'd play with a rag doll, tossing him floppily about, dangling him by an arm or leg, he looking glassy- eyed and like he'd lost his bones.
zh_cn: 玛莲经常像玩布娃娃那样玩驴蛋，轻轻地摇晃他，拉着手或脚把他提起来，而驴蛋则会目光呆滞的看着，而且像是没有了骨头一样。

source: It was funny, really. They could have taken the act on television.
zh_cn: 这确实很有趣，他们或许还可以上电视。

source: Playing with Dickie-boy like a rag doll was my daughter's favorite game.
zh_cn: 像玩布娃娃那样玩驴蛋，是我女儿最喜欢的游戏。

source: Then, one day, when Marleen was dragging him around by his soft ankles, his head broke off.
zh_cn: 一天，玛莲抓着驴蛋那柔软的脚踝拖着他走时，他的头掉了下来。

source: That scared my daughter. She came home crying, though eventually she went back again.
zh_cn: 我女儿被吓坏了，哭着回到家里，但她最后又去了农场。

source: Marleen told her that her mother hated Dickie- boy and had cut his head off and then glued it back on without telling Marleen, so that the head would come off again while they were playing and she'd be blamed for it.
zh_cn: 玛莲告诉她，她母亲讨厌驴蛋，把驴蛋的头割了下来，然后又用胶水粘了回去，而且没有告诉她，所以在她们玩耍的时候驴蛋的头才会掉下来，这应该怪她母亲。

source: But the police chief, who went to investigate the death, told me that, after talking with the boy's folks, he was convinced it was just a tragic household accident that the little girl was inventing wild stories about.
zh_cn: 不过，调查驴蛋之死的警长告诉我，在询问了驴蛋的亲人后，他确信那只是一场悲惨的家庭事故，而玛莲只是在编造故事而已。

source: The boy was buried alongside his mother under the crabapple tree, and that was also sad, but the little boy had never quite seemed part of this world in the first place, so it wasn't as sad as when his mother died.
zh_cn: 驴蛋被葬在花红树下母亲的旁边，这也让人很悲伤，但是他似乎从来就不太属于这个世界，所以他的死没有他母亲的死那样让人伤心。

source: I'd been seeing the police chief on and off since my husband left me. Even before, if truth be told.
zh_cn: 在丈夫离开我之前，实话说，甚至在他还没有离开时，我就在偶尔与警长约会。

source: He was sweet and was sometimes fun to be with, but mostly he wasn't, being something of a nail-chewing worrywart by nature.
zh_cn: 他很甜蜜，有时和他在一起很有趣，但他通常都很无趣，天生就是个爱咬指甲、爱发愁的人。

source: I could see why his wife had left him.
zh_cn: 我能知道他的妻子为何离开他。

source: The fire marshal was more fun and never worried about anything, but he'd already had three wives and he said he didn't want any more.
zh_cn: 消防队长更有趣些，从来不担忧事情，但是他已经有过三任妻子，所以他说不想再娶妻子了。

source: He preferred booze to broads now, as he put it, and- more than either- the weekly football on the box.
zh_cn: 他说他现在喜欢喝酒更甚于喝酒，而且更喜欢看电视上每周转播的足球赛。

source: The police chief had been a senior when I was just a freshman.
zh_cn: 警长上大四时，我才进大一。

source: We did some things together back then, but I was still very young and shy, and I guess, thinking back, he was, too.
zh_cn: 我们当时一起做了些事，但我那时还太年轻和腼腆，而且，现在回想起来，我觉得他当时也和我一样。

source: He was a Catholic and I was a Lutheran, so it wouldn't have worked out anyway.
zh_cn: 他信奉天主教，我信奉路德教，所以我和他肯定不会有结果。

source: We were both still churchgoers, so nothing was going to work out now, either, but, at this time of life, that was no longer enough to keep two lonely people out of the same bed.
zh_cn: 我们都会按时去教堂礼拜，所以现在我们也不会有结果。但是，在人生的这个阶段上，那已经不能阻止两个寂寞的人同床共枕了。

source: A few weeks after Dickie-boy died, my daughter went out to the farm one day and found Marleen sitting beside a hole in the ground under the crabapple tree, playing with a pile of bones.
zh_cn: 驴蛋死后几周的一天，我女儿去了农场，碰到玛莲坐在花红树下地上的一个洞边，玩着一堆骨头。

source: Marleen said that the bones were those of her stepbrother, whom her mother had cooked up in a black-beer stew, which her stepfather ate, gnawing all the little bones clean before burying them.
zh_cn: 玛莲说，那些骨头是驴蛋的，母亲用黑啤酒把驴蛋炖给继父吃，而继父把这些小骨头啃干净，然后埋在了地里。

source: Marleen had dug them up and was stringing together a kind of horrible life- size Halloween puppet.
zh_cn: 玛莲把骨头挖出来，用线连成一个真人大小的恐怖的万圣节玩偶。

source: She was reciting a rhyme about singing bones, and then she warbled like a bird and held up the bone puppet and rattled it.
zh_cn: 她背诵着一首关于会唱歌的骨头的韵词，然后像鸟那样啭鸣起来，提起骨骼玩偶，让它发出喀哒喀哒的声音。

source: That was when my daughter stopped playing with her.
zh_cn: 此后，我的女儿再也没有和她一起玩耍了。

source: There has to be a law against those sorts of things, but when I told the police chief what my daughter had said he only bit his nails and said that it was weird how kids could dream up such crazy stories.
zh_cn: 应该有法律管管这种事情，可是我把女儿的话告诉警长时，他只是咬着指甲说，孩子们能想出来这种疯狂的故事，真是奇怪。

source: I asked him if he didn't think it could be true, or at least partly true, and he said no, he knew the parents well, especially the girl's mother, and such a thing could not have happened.
zh_cn: 我问他是不是不相信这是真的，或者至少部分是真的。他说不相信，他很了解玛莲的父母，尤其是玛莲的母亲，那种事情不可能发生。

source: I realized then that, like half the town's heroes, the chief had probably been one of the Vamp's quickies, maybe still was.
zh_cn: 然后我就知道，警长可能和镇上半数的男人一样，曾经——或许仍然——和妖妇有染。

source: He wasn't interested in any further speculation about the girl he called "that cute little loony with the big eyes."
zh_cn: 我关于玛莲的推测，他丝毫不感兴趣，而且他把玛莲称呼为“那个长着大眼睛的可爱傻子”。

source: He did promise to drop by the farm to see if the grave had been molested, but he never told me if he did.
zh_cn: 他承诺要去农场看看驴蛋的坟墓是否被挖过，不过他没有告诉我他有没有去。

source: The part of Marleen's story that I thought might be true was how Dickie-boy had died.
zh_cn: 在玛莲编造的故事里，我觉得驴蛋是怎么死的那部分可能是真的。

source: The Vamp, who'd detested her stepson, was completely capable of doing him grievous bodily harm, as the chief would say, in his detective-movie way, and then making her daughter feel guilty for it.
zh_cn: 憎恨继子的妖妇完全能够对他造成严重的身体伤害——警长也会以他那侦探电影般的方式这样说——然后让她的女儿为此觉得内疚。

source: There was something monstrous about her- we all felt it.
zh_cn: 我们都感觉得到，妖妇有些丑恶的品质。

source: Of course, she'd messed up a lot of our marriages, so we weren't exactly unbiased.
zh_cn: 当然，她毁了我们许多人的婚姻，所以我并非完全没有偏见。

source: I didn't think that Dickie-boy's dad would have eaten him on purpose, but he was often so drunk that he didn't know what he was doing, and maybe the Vamp had tricked him into it.
zh_cn: 我觉得驴蛋的父亲不会故意吃他，可他经常醉得不知道自己在做什么，所以可能是妖妇骗他吃掉驴蛋的。

source: Stews are stews. Who knows what's in them?
zh_cn: 炖肉就是炖肉，谁知道里面有什么呢？

source: The fire marshal told me that he'd been drinking one night with Dickie-boy's dad, who'd complained that people misunderstood his wife.
zh_cn: 消防队长告诉我，他有天晚上和驴蛋的父亲一起喝酒，驴蛋的父亲抱怨说人们误会了他的妻子。
